{
  "modelTopology": {
    "training_config": {
      "metrics": ["accuracy"],
      "loss": "categorical_crossentropy",
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "decay": 0.0,
          "epsilon": 1e-7,
          "amsgrad": false,
          "lr": 1.9999999494757503e-5
        }
      },
      "loss_weights": null,
      "sample_weight_mode": null
    },
    "keras_version": "2.2.4",
    "model_config": {
      "class_name": "Model",
      "config": {
        "layers": [
          {
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "config": {
              "dtype": "float32",
              "batch_input_shape": [null, 224, 224, 3],
              "name": "input_1",
              "sparse": false
            },
            "name": "input_1"
          },
          {
            "class_name": "ZeroPadding2D",
            "inbound_nodes": [[["input_1", 0, 0, {}]]],
            "config": {
              "padding": [[0, 1], [0, 1]],
              "trainable": false,
              "name": "conv1_pad",
              "data_format": "channels_last"
            },
            "name": "conv1_pad"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv1_pad", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [2, 2],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 32,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv1", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv1_bn"
            },
            "name": "conv1_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv1_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv1_relu",
              "threshold": 0.0
            },
            "name": "conv1_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv1_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_1_bn"
            },
            "name": "conv_dw_1_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_1_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_1_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_1",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_1_bn"
            },
            "name": "conv_pw_1_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_1_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_1_relu"
          },
          {
            "class_name": "ZeroPadding2D",
            "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]],
            "config": {
              "padding": [[0, 1], [0, 1]],
              "trainable": false,
              "name": "conv_pad_2",
              "data_format": "channels_last"
            },
            "name": "conv_pad_2"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_2",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "valid",
              "strides": [2, 2],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_2_bn"
            },
            "name": "conv_dw_2_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_2_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_2_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_2",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 128,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_2_bn"
            },
            "name": "conv_pw_2_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_2_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_2_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_3",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_3_bn"
            },
            "name": "conv_dw_3_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_3_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_3_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_3",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 128,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_3"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_3_bn"
            },
            "name": "conv_pw_3_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_3_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_3_relu"
          },
          {
            "class_name": "ZeroPadding2D",
            "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]],
            "config": {
              "padding": [[0, 1], [0, 1]],
              "trainable": false,
              "name": "conv_pad_4",
              "data_format": "channels_last"
            },
            "name": "conv_pad_4"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_4",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "valid",
              "strides": [2, 2],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_4"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_4_bn"
            },
            "name": "conv_dw_4_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_4_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_4_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_4",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 256,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_4"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_4_bn"
            },
            "name": "conv_pw_4_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_4_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_4_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_5",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_5"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_5_bn"
            },
            "name": "conv_dw_5_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_5_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_5_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_5",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 256,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_5"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_5_bn"
            },
            "name": "conv_pw_5_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_5_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_5_relu"
          },
          {
            "class_name": "ZeroPadding2D",
            "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]],
            "config": {
              "padding": [[0, 1], [0, 1]],
              "trainable": false,
              "name": "conv_pad_6",
              "data_format": "channels_last"
            },
            "name": "conv_pad_6"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_6",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "valid",
              "strides": [2, 2],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_6"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_6_bn"
            },
            "name": "conv_dw_6_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_6_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_6_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_6",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 512,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_6"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_6_bn"
            },
            "name": "conv_pw_6_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_6_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_6_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_7",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_7"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_7_bn"
            },
            "name": "conv_dw_7_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_7_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_7_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_7",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 512,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_7"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_7_bn"
            },
            "name": "conv_pw_7_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_7_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_7_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_8",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_8"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_8_bn"
            },
            "name": "conv_dw_8_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_8_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_8_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_8",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 512,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_8"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_8_bn"
            },
            "name": "conv_pw_8_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_8_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_8_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]],
            "config": {
              "depth_multiplier": 1,
              "name": "conv_dw_9",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "depthwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "depthwise_regularizer": null,
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [3, 3]
            },
            "name": "conv_dw_9"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_dw_9_bn"
            },
            "name": "conv_dw_9_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_dw_9_relu",
              "threshold": 0.0
            },
            "name": "conv_dw_9_relu"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]],
            "config": {
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "conv_pw_9",
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": false,
              "data_format": "channels_last",
              "padding": "same",
              "strides": [1, 1],
              "dilation_rate": [1, 1],
              "kernel_regularizer": null,
              "filters": 512,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [1, 1]
            },
            "name": "conv_pw_9"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]],
            "config": {
              "beta_constraint": null,
              "scale": true,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "center": true,
              "epsilon": 0.001,
              "trainable": false,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "axis": -1,
              "beta_regularizer": null,
              "momentum": 0.99,
              "name": "conv_pw_9_bn"
            },
            "name": "conv_pw_9_bn"
          },
          {
            "class_name": "ReLU",
            "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]],
            "config": {
              "negative_slope": 0.0,
              "max_value": 6.0,
              "trainable": false,
              "name": "conv_pw_9_relu",
              "threshold": 0.0
            },
            "name": "conv_pw_9_relu"
          },
          {
            "class_name": "DepthwiseConv2D",
            "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]],
